earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Raspberry Pi Pico W
# -----------------------------------
rpipicow.name=Raspberry Pi Pico W
rpipicow.vid.0=0x2e8a
rpipicow.pid.0=0xf00a
rpipicow.vid.1=0x2e8a
rpipicow.pid.1=0xf10a
rpipicow.vid.2=0x2e8a
rpipicow.pid.2=0xf00a
rpipicow.vid.3=0x2e8a
rpipicow.pid.3=0xf10a
rpipicow.vid.4=0x2e8a
rpipicow.pid.4=0xf00a
rpipicow.vid.5=0x2e8a
rpipicow.pid.5=0xf10a
rpipicow.vid.6=0x2e8a
rpipicow.pid.6=0xf00a
rpipicow.vid.7=0x2e8a
rpipicow.pid.7=0xf10a
rpipicow.build.usbvid=-DUSBD_VID=0x2e8a
rpipicow.build.usbpid=-DUSBD_PID=0xf00a
rpipicow.build.usbpwr=-DUSBD_MAX_POWER_MA=250
rpipicow.build.board=RASPBERRY_PI_PICO_W
rpipicow.build.mcu=cortex-m0plus
rpipicow.build.variant=rpipicow
rpipicow.upload.maximum_size=2097152
rpipicow.upload.wait_for_upload_port=true
rpipicow.upload.erase_cmd=
rpipicow.serial.disableDTR=false
rpipicow.serial.disableRTS=false
rpipicow.build.f_cpu=125000000
rpipicow.build.led=
rpipicow.build.core=rp2040
rpipicow.build.ldscript=memmap_default.ld
rpipicow.build.boot2=boot2_w25q080_2_padded_checksum
rpipicow.build.usb_manufacturer="Raspberry Pi"
rpipicow.build.usb_product="Pico W"
rpipicow.menu.flash.2097152_0=2MB (no FS)
rpipicow.menu.flash.2097152_0.upload.maximum_size=2093056
rpipicow.menu.flash.2097152_0.build.flash_length=2093056
rpipicow.menu.flash.2097152_0.build.eeprom_start=270528512
rpipicow.menu.flash.2097152_0.build.fs_start=270528512
rpipicow.menu.flash.2097152_0.build.fs_end=270528512
rpipicow.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
rpipicow.menu.flash.2097152_65536.upload.maximum_size=2027520
rpipicow.menu.flash.2097152_65536.build.flash_length=2027520
rpipicow.menu.flash.2097152_65536.build.eeprom_start=270528512
rpipicow.menu.flash.2097152_65536.build.fs_start=270462976
rpipicow.menu.flash.2097152_65536.build.fs_end=270528512
rpipicow.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
rpipicow.menu.flash.2097152_131072.upload.maximum_size=1961984
rpipicow.menu.flash.2097152_131072.build.flash_length=1961984
rpipicow.menu.flash.2097152_131072.build.eeprom_start=270528512
rpipicow.menu.flash.2097152_131072.build.fs_start=270397440
rpipicow.menu.flash.2097152_131072.build.fs_end=270528512
rpipicow.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
rpipicow.menu.flash.2097152_262144.upload.maximum_size=1830912
rpipicow.menu.flash.2097152_262144.build.flash_length=1830912
rpipicow.menu.flash.2097152_262144.build.eeprom_start=270528512
rpipicow.menu.flash.2097152_262144.build.fs_start=270266368
rpipicow.menu.flash.2097152_262144.build.fs_end=270528512
rpipicow.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
rpipicow.menu.flash.2097152_524288.upload.maximum_size=1568768
rpipicow.menu.flash.2097152_524288.build.flash_length=1568768
rpipicow.menu.flash.2097152_524288.build.eeprom_start=270528512
rpipicow.menu.flash.2097152_524288.build.fs_start=270004224
rpipicow.menu.flash.2097152_524288.build.fs_end=270528512
rpipicow.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
rpipicow.menu.flash.2097152_1048576.upload.maximum_size=1044480
rpipicow.menu.flash.2097152_1048576.build.flash_length=1044480
rpipicow.menu.flash.2097152_1048576.build.eeprom_start=270528512
rpipicow.menu.flash.2097152_1048576.build.fs_start=269479936
rpipicow.menu.flash.2097152_1048576.build.fs_end=270528512
rpipicow.menu.freq.133=133 MHz
rpipicow.menu.freq.133.build.f_cpu=133000000L
rpipicow.menu.freq.50=50 MHz
rpipicow.menu.freq.50.build.f_cpu=50000000L
rpipicow.menu.freq.100=100 MHz
rpipicow.menu.freq.100.build.f_cpu=100000000L
rpipicow.menu.freq.120=120 MHz
rpipicow.menu.freq.120.build.f_cpu=120000000L
rpipicow.menu.freq.125=125 MHz
rpipicow.menu.freq.125.build.f_cpu=125000000L
rpipicow.menu.freq.150=150 MHz (Overclock)
rpipicow.menu.freq.150.build.f_cpu=150000000L
rpipicow.menu.freq.175=175 MHz (Overclock)
rpipicow.menu.freq.175.build.f_cpu=175000000L
rpipicow.menu.freq.200=200 MHz (Overclock)
rpipicow.menu.freq.200.build.f_cpu=200000000L
rpipicow.menu.freq.225=225 MHz (Overclock)
rpipicow.menu.freq.225.build.f_cpu=225000000L
rpipicow.menu.freq.240=240 MHz (Overclock)
rpipicow.menu.freq.240.build.f_cpu=240000000L
rpipicow.menu.freq.250=250 MHz (Overclock)
rpipicow.menu.freq.250.build.f_cpu=250000000L
rpipicow.menu.freq.275=275 MHz (Overclock)
rpipicow.menu.freq.275.build.f_cpu=275000000L
rpipicow.menu.freq.300=300 MHz (Overclock)
rpipicow.menu.freq.300.build.f_cpu=300000000L
rpipicow.menu.opt.Small=Small (-Os) (standard)
rpipicow.menu.opt.Small.build.flags.optimize=-Os
rpipicow.menu.opt.Optimize=Optimize (-O)
rpipicow.menu.opt.Optimize.build.flags.optimize=-O
rpipicow.menu.opt.Optimize2=Optimize More (-O2)
rpipicow.menu.opt.Optimize2.build.flags.optimize=-O2
rpipicow.menu.opt.Optimize3=Optimize Even More (-O3)
rpipicow.menu.opt.Optimize3.build.flags.optimize=-O3
rpipicow.menu.opt.Fast=Fast (-Ofast) (maybe slower)
rpipicow.menu.opt.Fast.build.flags.optimize=-Ofast
rpipicow.menu.opt.Debug=Debug (-Og)
rpipicow.menu.opt.Debug.build.flags.optimize=-Og
rpipicow.menu.rtti.Disabled=Disabled
rpipicow.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
rpipicow.menu.rtti.Enabled=Enabled
rpipicow.menu.rtti.Enabled.build.flags.rtti=
rpipicow.menu.stackprotect.Disabled=Disabled
rpipicow.menu.stackprotect.Disabled.build.flags.stackprotect=
rpipicow.menu.stackprotect.Enabled=Enabled
rpipicow.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
rpipicow.menu.exceptions.Disabled=Disabled
rpipicow.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
rpipicow.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
rpipicow.menu.exceptions.Enabled=Enabled
rpipicow.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
rpipicow.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
rpipicow.menu.dbgport.Disabled=Disabled
rpipicow.menu.dbgport.Disabled.build.debug_port=
rpipicow.menu.dbgport.Serial=Serial
rpipicow.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
rpipicow.menu.dbgport.Serial1=Serial1
rpipicow.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
rpipicow.menu.dbgport.Serial2=Serial2
rpipicow.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
rpipicow.menu.dbglvl.None=None
rpipicow.menu.dbglvl.None.build.debug_level=
rpipicow.menu.dbglvl.Core=Core
rpipicow.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
rpipicow.menu.dbglvl.SPI=SPI
rpipicow.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
rpipicow.menu.dbglvl.Wire=Wire
rpipicow.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
rpipicow.menu.dbglvl.All=All
rpipicow.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
rpipicow.menu.dbglvl.NDEBUG=NDEBUG
rpipicow.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
rpipicow.menu.usbstack.picosdk=Pico SDK
rpipicow.menu.usbstack.picosdk.build.usbstack_flags=
rpipicow.menu.usbstack.tinyusb=Adafruit TinyUSB
rpipicow.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
rpipicow.menu.usbstack.nousb=No USB
rpipicow.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
rpipicow.menu.wificountry.worldwide=Worldwide
rpipicow.menu.wificountry.worldwide.build.wificc=-DWIFICC=CYW43_COUNTRY_WORLDWIDE
rpipicow.menu.wificountry.australia=Australia
rpipicow.menu.wificountry.australia.build.wificc=-DWIFICC=CYW43_COUNTRY_AUSTRALIA
rpipicow.menu.wificountry.austria=Austria
rpipicow.menu.wificountry.austria.build.wificc=-DWIFICC=CYW43_COUNTRY_AUSTRIA
rpipicow.menu.wificountry.belgium=Belgium
rpipicow.menu.wificountry.belgium.build.wificc=-DWIFICC=CYW43_COUNTRY_BELGIUM
rpipicow.menu.wificountry.brazil=Brazil
rpipicow.menu.wificountry.brazil.build.wificc=-DWIFICC=CYW43_COUNTRY_BRAZIL
rpipicow.menu.wificountry.canada=Canada
rpipicow.menu.wificountry.canada.build.wificc=-DWIFICC=CYW43_COUNTRY_CANADA
rpipicow.menu.wificountry.chile=Chile
rpipicow.menu.wificountry.chile.build.wificc=-DWIFICC=CYW43_COUNTRY_CHILE
rpipicow.menu.wificountry.china=China
rpipicow.menu.wificountry.china.build.wificc=-DWIFICC=CYW43_COUNTRY_CHINA
rpipicow.menu.wificountry.colombia=Colombia
rpipicow.menu.wificountry.colombia.build.wificc=-DWIFICC=CYW43_COUNTRY_COLOMBIA
rpipicow.menu.wificountry.czech_republic=Czech Republic
rpipicow.menu.wificountry.czech_republic.build.wificc=-DWIFICC=CYW43_COUNTRY_CZECH_REPUBLIC
rpipicow.menu.wificountry.denmark=Denmark
rpipicow.menu.wificountry.denmark.build.wificc=-DWIFICC=CYW43_COUNTRY_DENMARK
rpipicow.menu.wificountry.estonia=Estonia
rpipicow.menu.wificountry.estonia.build.wificc=-DWIFICC=CYW43_COUNTRY_ESTONIA
rpipicow.menu.wificountry.finland=Finland
rpipicow.menu.wificountry.finland.build.wificc=-DWIFICC=CYW43_COUNTRY_FINLAND
rpipicow.menu.wificountry.france=France
rpipicow.menu.wificountry.france.build.wificc=-DWIFICC=CYW43_COUNTRY_FRANCE
rpipicow.menu.wificountry.germany=Germany
rpipicow.menu.wificountry.germany.build.wificc=-DWIFICC=CYW43_COUNTRY_GERMANY
rpipicow.menu.wificountry.greece=Greece
rpipicow.menu.wificountry.greece.build.wificc=-DWIFICC=CYW43_COUNTRY_GREECE
rpipicow.menu.wificountry.hong_kong=Hong Kong
rpipicow.menu.wificountry.hong_kong.build.wificc=-DWIFICC=CYW43_COUNTRY_HONG_KONG
rpipicow.menu.wificountry.hungary=Hungary
rpipicow.menu.wificountry.hungary.build.wificc=-DWIFICC=CYW43_COUNTRY_HUNGARY
rpipicow.menu.wificountry.iceland=Iceland
rpipicow.menu.wificountry.iceland.build.wificc=-DWIFICC=CYW43_COUNTRY_ICELAND
rpipicow.menu.wificountry.india=India
rpipicow.menu.wificountry.india.build.wificc=-DWIFICC=CYW43_COUNTRY_INDIA
rpipicow.menu.wificountry.israel=Israel
rpipicow.menu.wificountry.israel.build.wificc=-DWIFICC=CYW43_COUNTRY_ISRAEL
rpipicow.menu.wificountry.italy=Italy
rpipicow.menu.wificountry.italy.build.wificc=-DWIFICC=CYW43_COUNTRY_ITALY
rpipicow.menu.wificountry.japan=Japan
rpipicow.menu.wificountry.japan.build.wificc=-DWIFICC=CYW43_COUNTRY_JAPAN
rpipicow.menu.wificountry.kenya=Kenya
rpipicow.menu.wificountry.kenya.build.wificc=-DWIFICC=CYW43_COUNTRY_KENYA
rpipicow.menu.wificountry.latvia=Latvia
rpipicow.menu.wificountry.latvia.build.wificc=-DWIFICC=CYW43_COUNTRY_LATVIA
rpipicow.menu.wificountry.liechtenstein=Liechtenstein
rpipicow.menu.wificountry.liechtenstein.build.wificc=-DWIFICC=CYW43_COUNTRY_LIECHTENSTEIN
rpipicow.menu.wificountry.lithuania=Lithuania
rpipicow.menu.wificountry.lithuania.build.wificc=-DWIFICC=CYW43_COUNTRY_LITHUANIA
rpipicow.menu.wificountry.luxembourg=Luxembourg
rpipicow.menu.wificountry.luxembourg.build.wificc=-DWIFICC=CYW43_COUNTRY_LUXEMBOURG
rpipicow.menu.wificountry.malaysia=Malaysia
rpipicow.menu.wificountry.malaysia.build.wificc=-DWIFICC=CYW43_COUNTRY_MALAYSIA
rpipicow.menu.wificountry.malta=Malta
rpipicow.menu.wificountry.malta.build.wificc=-DWIFICC=CYW43_COUNTRY_MALTA
rpipicow.menu.wificountry.mexico=Mexico
rpipicow.menu.wificountry.mexico.build.wificc=-DWIFICC=CYW43_COUNTRY_MEXICO
rpipicow.menu.wificountry.netherlands=Netherlands
rpipicow.menu.wificountry.netherlands.build.wificc=-DWIFICC=CYW43_COUNTRY_NETHERLANDS
rpipicow.menu.wificountry.new_zealand=New Zealand
rpipicow.menu.wificountry.new_zealand.build.wificc=-DWIFICC=CYW43_COUNTRY_NEW_ZEALAND
rpipicow.menu.wificountry.nigeria=Nigeria
rpipicow.menu.wificountry.nigeria.build.wificc=-DWIFICC=CYW43_COUNTRY_NIGERIA
rpipicow.menu.wificountry.norway=Norway
rpipicow.menu.wificountry.norway.build.wificc=-DWIFICC=CYW43_COUNTRY_NORWAY
rpipicow.menu.wificountry.peru=Peru
rpipicow.menu.wificountry.peru.build.wificc=-DWIFICC=CYW43_COUNTRY_PERU
rpipicow.menu.wificountry.philippines=Philippines
rpipicow.menu.wificountry.philippines.build.wificc=-DWIFICC=CYW43_COUNTRY_PHILIPPINES
rpipicow.menu.wificountry.poland=Poland
rpipicow.menu.wificountry.poland.build.wificc=-DWIFICC=CYW43_COUNTRY_POLAND
rpipicow.menu.wificountry.portugal=Portugal
rpipicow.menu.wificountry.portugal.build.wificc=-DWIFICC=CYW43_COUNTRY_PORTUGAL
rpipicow.menu.wificountry.singapore=Singapore
rpipicow.menu.wificountry.singapore.build.wificc=-DWIFICC=CYW43_COUNTRY_SINGAPORE
rpipicow.menu.wificountry.slovakia=Slovakia
rpipicow.menu.wificountry.slovakia.build.wificc=-DWIFICC=CYW43_COUNTRY_SLOVAKIA
rpipicow.menu.wificountry.slovenia=Slovenia
rpipicow.menu.wificountry.slovenia.build.wificc=-DWIFICC=CYW43_COUNTRY_SLOVENIA
rpipicow.menu.wificountry.south_africa=South Africa
rpipicow.menu.wificountry.south_africa.build.wificc=-DWIFICC=CYW43_COUNTRY_SOUTH_AFRICA
rpipicow.menu.wificountry.south_korea=South Korea
rpipicow.menu.wificountry.south_korea.build.wificc=-DWIFICC=CYW43_COUNTRY_SOUTH_KOREA
rpipicow.menu.wificountry.spain=Spain
rpipicow.menu.wificountry.spain.build.wificc=-DWIFICC=CYW43_COUNTRY_SPAIN
rpipicow.menu.wificountry.sweden=Sweden
rpipicow.menu.wificountry.sweden.build.wificc=-DWIFICC=CYW43_COUNTRY_SWEDEN
rpipicow.menu.wificountry.switzerland=Switzerland
rpipicow.menu.wificountry.switzerland.build.wificc=-DWIFICC=CYW43_COUNTRY_SWITZERLAND
rpipicow.menu.wificountry.taiwan=Taiwan
rpipicow.menu.wificountry.taiwan.build.wificc=-DWIFICC=CYW43_COUNTRY_TAIWAN
rpipicow.menu.wificountry.thailand=Thailand
rpipicow.menu.wificountry.thailand.build.wificc=-DWIFICC=CYW43_COUNTRY_THAILAND
rpipicow.menu.wificountry.turkey=Turkey
rpipicow.menu.wificountry.turkey.build.wificc=-DWIFICC=CYW43_COUNTRY_TURKEY
rpipicow.menu.wificountry.uk=UK
rpipicow.menu.wificountry.uk.build.wificc=-DWIFICC=CYW43_COUNTRY_UK
rpipicow.menu.wificountry.usa=USA
rpipicow.menu.wificountry.usa.build.wificc=-DWIFICC=CYW43_COUNTRY_USA
rpipicow.menu.ipbtstack.ipv4only=IPv4 Only
rpipicow.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
rpipicow.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
rpipicow.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
rpipicow.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
rpipicow.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
rpipicow.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
rpipicow.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
rpipicow.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
rpipicow.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
rpipicow.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
rpipicow.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
rpipicow.menu.uploadmethod.default=Default (UF2)
rpipicow.menu.uploadmethod.default.build.ram_length=256k
rpipicow.menu.uploadmethod.default.build.debugscript=picoprobe.tcl
rpipicow.menu.uploadmethod.default.upload.maximum_data_size=262144
rpipicow.menu.uploadmethod.default.upload.tool=uf2conv
rpipicow.menu.uploadmethod.default.upload.tool.default=uf2conv
rpipicow.menu.uploadmethod.default.upload.tool.network=uf2conv-network
rpipicow.menu.uploadmethod.picotool=Picotool
rpipicow.menu.uploadmethod.picotool.build.ram_length=256k
rpipicow.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
rpipicow.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
rpipicow.menu.uploadmethod.picotool.upload.maximum_data_size=262144
rpipicow.menu.uploadmethod.picotool.upload.tool=picotool
rpipicow.menu.uploadmethod.picotool.upload.tool.default=picotool
rpipicow.menu.uploadmethod.picoprobe=Picoprobe
rpipicow.menu.uploadmethod.picoprobe.build.ram_length=256k
rpipicow.menu.uploadmethod.picoprobe.build.debugscript=picoprobe.tcl
rpipicow.menu.uploadmethod.picoprobe.upload.maximum_data_size=262144
rpipicow.menu.uploadmethod.picoprobe.upload.tool=picoprobe
rpipicow.menu.uploadmethod.picoprobe.upload.tool.default=picoprobe
rpipicow.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
rpipicow.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
rpipicow.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
rpipicow.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
rpipicow.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
rpipicow.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
rpipicow.menu.uploadmethod.picodebug=Pico-Debug
rpipicow.menu.uploadmethod.picodebug.build.ram_length=240k
rpipicow.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
rpipicow.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
rpipicow.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
rpipicow.menu.uploadmethod.picodebug.upload.tool=picodebug
rpipicow.menu.uploadmethod.picodebug.upload.tool.default=picodebug

