earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# DatanoiseTV PicoADK
# -----------------------------------
datanoisetv_picoadk.name=DatanoiseTV PicoADK
datanoisetv_picoadk.vid.0=0x2e8a
datanoisetv_picoadk.pid.0=0x000a
datanoisetv_picoadk.vid.1=0x2e8a
datanoisetv_picoadk.pid.1=0x010a
datanoisetv_picoadk.vid.2=0x2e8a
datanoisetv_picoadk.pid.2=0x400a
datanoisetv_picoadk.vid.3=0x2e8a
datanoisetv_picoadk.pid.3=0x410a
datanoisetv_picoadk.vid.4=0x2e8a
datanoisetv_picoadk.pid.4=0x800a
datanoisetv_picoadk.vid.5=0x2e8a
datanoisetv_picoadk.pid.5=0x810a
datanoisetv_picoadk.vid.6=0x2e8a
datanoisetv_picoadk.pid.6=0xc00a
datanoisetv_picoadk.vid.7=0x2e8a
datanoisetv_picoadk.pid.7=0xc10a
datanoisetv_picoadk.build.usbvid=-DUSBD_VID=0x2e8a
datanoisetv_picoadk.build.usbpid=-DUSBD_PID=0x000a
datanoisetv_picoadk.build.usbpwr=-DUSBD_MAX_POWER_MA=250
datanoisetv_picoadk.build.board=DATANOISETV_PICOADK
datanoisetv_picoadk.build.mcu=cortex-m0plus
datanoisetv_picoadk.build.variant=datanoisetv_picoadk
datanoisetv_picoadk.upload.maximum_size=2097152
datanoisetv_picoadk.upload.wait_for_upload_port=true
datanoisetv_picoadk.upload.erase_cmd=
datanoisetv_picoadk.serial.disableDTR=false
datanoisetv_picoadk.serial.disableRTS=false
datanoisetv_picoadk.build.f_cpu=125000000
datanoisetv_picoadk.build.led=
datanoisetv_picoadk.build.core=rp2040
datanoisetv_picoadk.build.ldscript=memmap_default.ld
datanoisetv_picoadk.build.boot2=boot2_w25q080_2_padded_checksum
datanoisetv_picoadk.build.usb_manufacturer="DatanoiseTV"
datanoisetv_picoadk.build.usb_product="PicoADK"
datanoisetv_picoadk.menu.flash.2097152_0=2MB (no FS)
datanoisetv_picoadk.menu.flash.2097152_0.upload.maximum_size=2093056
datanoisetv_picoadk.menu.flash.2097152_0.build.flash_length=2093056
datanoisetv_picoadk.menu.flash.2097152_0.build.eeprom_start=270528512
datanoisetv_picoadk.menu.flash.2097152_0.build.fs_start=270528512
datanoisetv_picoadk.menu.flash.2097152_0.build.fs_end=270528512
datanoisetv_picoadk.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
datanoisetv_picoadk.menu.flash.2097152_65536.upload.maximum_size=2027520
datanoisetv_picoadk.menu.flash.2097152_65536.build.flash_length=2027520
datanoisetv_picoadk.menu.flash.2097152_65536.build.eeprom_start=270528512
datanoisetv_picoadk.menu.flash.2097152_65536.build.fs_start=270462976
datanoisetv_picoadk.menu.flash.2097152_65536.build.fs_end=270528512
datanoisetv_picoadk.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
datanoisetv_picoadk.menu.flash.2097152_131072.upload.maximum_size=1961984
datanoisetv_picoadk.menu.flash.2097152_131072.build.flash_length=1961984
datanoisetv_picoadk.menu.flash.2097152_131072.build.eeprom_start=270528512
datanoisetv_picoadk.menu.flash.2097152_131072.build.fs_start=270397440
datanoisetv_picoadk.menu.flash.2097152_131072.build.fs_end=270528512
datanoisetv_picoadk.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
datanoisetv_picoadk.menu.flash.2097152_262144.upload.maximum_size=1830912
datanoisetv_picoadk.menu.flash.2097152_262144.build.flash_length=1830912
datanoisetv_picoadk.menu.flash.2097152_262144.build.eeprom_start=270528512
datanoisetv_picoadk.menu.flash.2097152_262144.build.fs_start=270266368
datanoisetv_picoadk.menu.flash.2097152_262144.build.fs_end=270528512
datanoisetv_picoadk.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
datanoisetv_picoadk.menu.flash.2097152_524288.upload.maximum_size=1568768
datanoisetv_picoadk.menu.flash.2097152_524288.build.flash_length=1568768
datanoisetv_picoadk.menu.flash.2097152_524288.build.eeprom_start=270528512
datanoisetv_picoadk.menu.flash.2097152_524288.build.fs_start=270004224
datanoisetv_picoadk.menu.flash.2097152_524288.build.fs_end=270528512
datanoisetv_picoadk.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
datanoisetv_picoadk.menu.flash.2097152_1048576.upload.maximum_size=1044480
datanoisetv_picoadk.menu.flash.2097152_1048576.build.flash_length=1044480
datanoisetv_picoadk.menu.flash.2097152_1048576.build.eeprom_start=270528512
datanoisetv_picoadk.menu.flash.2097152_1048576.build.fs_start=269479936
datanoisetv_picoadk.menu.flash.2097152_1048576.build.fs_end=270528512
datanoisetv_picoadk.menu.freq.133=133 MHz
datanoisetv_picoadk.menu.freq.133.build.f_cpu=133000000L
datanoisetv_picoadk.menu.freq.50=50 MHz
datanoisetv_picoadk.menu.freq.50.build.f_cpu=50000000L
datanoisetv_picoadk.menu.freq.100=100 MHz
datanoisetv_picoadk.menu.freq.100.build.f_cpu=100000000L
datanoisetv_picoadk.menu.freq.120=120 MHz
datanoisetv_picoadk.menu.freq.120.build.f_cpu=120000000L
datanoisetv_picoadk.menu.freq.125=125 MHz
datanoisetv_picoadk.menu.freq.125.build.f_cpu=125000000L
datanoisetv_picoadk.menu.freq.150=150 MHz (Overclock)
datanoisetv_picoadk.menu.freq.150.build.f_cpu=150000000L
datanoisetv_picoadk.menu.freq.175=175 MHz (Overclock)
datanoisetv_picoadk.menu.freq.175.build.f_cpu=175000000L
datanoisetv_picoadk.menu.freq.200=200 MHz (Overclock)
datanoisetv_picoadk.menu.freq.200.build.f_cpu=200000000L
datanoisetv_picoadk.menu.freq.225=225 MHz (Overclock)
datanoisetv_picoadk.menu.freq.225.build.f_cpu=225000000L
datanoisetv_picoadk.menu.freq.240=240 MHz (Overclock)
datanoisetv_picoadk.menu.freq.240.build.f_cpu=240000000L
datanoisetv_picoadk.menu.freq.250=250 MHz (Overclock)
datanoisetv_picoadk.menu.freq.250.build.f_cpu=250000000L
datanoisetv_picoadk.menu.freq.275=275 MHz (Overclock)
datanoisetv_picoadk.menu.freq.275.build.f_cpu=275000000L
datanoisetv_picoadk.menu.freq.300=300 MHz (Overclock)
datanoisetv_picoadk.menu.freq.300.build.f_cpu=300000000L
datanoisetv_picoadk.menu.opt.Small=Small (-Os) (standard)
datanoisetv_picoadk.menu.opt.Small.build.flags.optimize=-Os
datanoisetv_picoadk.menu.opt.Optimize=Optimize (-O)
datanoisetv_picoadk.menu.opt.Optimize.build.flags.optimize=-O
datanoisetv_picoadk.menu.opt.Optimize2=Optimize More (-O2)
datanoisetv_picoadk.menu.opt.Optimize2.build.flags.optimize=-O2
datanoisetv_picoadk.menu.opt.Optimize3=Optimize Even More (-O3)
datanoisetv_picoadk.menu.opt.Optimize3.build.flags.optimize=-O3
datanoisetv_picoadk.menu.opt.Fast=Fast (-Ofast) (maybe slower)
datanoisetv_picoadk.menu.opt.Fast.build.flags.optimize=-Ofast
datanoisetv_picoadk.menu.opt.Debug=Debug (-Og)
datanoisetv_picoadk.menu.opt.Debug.build.flags.optimize=-Og
datanoisetv_picoadk.menu.rtti.Disabled=Disabled
datanoisetv_picoadk.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
datanoisetv_picoadk.menu.rtti.Enabled=Enabled
datanoisetv_picoadk.menu.rtti.Enabled.build.flags.rtti=
datanoisetv_picoadk.menu.stackprotect.Disabled=Disabled
datanoisetv_picoadk.menu.stackprotect.Disabled.build.flags.stackprotect=
datanoisetv_picoadk.menu.stackprotect.Enabled=Enabled
datanoisetv_picoadk.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
datanoisetv_picoadk.menu.exceptions.Disabled=Disabled
datanoisetv_picoadk.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
datanoisetv_picoadk.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
datanoisetv_picoadk.menu.exceptions.Enabled=Enabled
datanoisetv_picoadk.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
datanoisetv_picoadk.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
datanoisetv_picoadk.menu.dbgport.Disabled=Disabled
datanoisetv_picoadk.menu.dbgport.Disabled.build.debug_port=
datanoisetv_picoadk.menu.dbgport.Serial=Serial
datanoisetv_picoadk.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
datanoisetv_picoadk.menu.dbgport.Serial1=Serial1
datanoisetv_picoadk.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
datanoisetv_picoadk.menu.dbgport.Serial2=Serial2
datanoisetv_picoadk.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
datanoisetv_picoadk.menu.dbglvl.None=None
datanoisetv_picoadk.menu.dbglvl.None.build.debug_level=
datanoisetv_picoadk.menu.dbglvl.Core=Core
datanoisetv_picoadk.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
datanoisetv_picoadk.menu.dbglvl.SPI=SPI
datanoisetv_picoadk.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
datanoisetv_picoadk.menu.dbglvl.Wire=Wire
datanoisetv_picoadk.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
datanoisetv_picoadk.menu.dbglvl.All=All
datanoisetv_picoadk.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
datanoisetv_picoadk.menu.dbglvl.NDEBUG=NDEBUG
datanoisetv_picoadk.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
datanoisetv_picoadk.menu.usbstack.picosdk=Pico SDK
datanoisetv_picoadk.menu.usbstack.picosdk.build.usbstack_flags=
datanoisetv_picoadk.menu.usbstack.tinyusb=Adafruit TinyUSB
datanoisetv_picoadk.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
datanoisetv_picoadk.menu.usbstack.nousb=No USB
datanoisetv_picoadk.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
datanoisetv_picoadk.menu.ipbtstack.ipv4only=IPv4 Only
datanoisetv_picoadk.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
datanoisetv_picoadk.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
datanoisetv_picoadk.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
datanoisetv_picoadk.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
datanoisetv_picoadk.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
datanoisetv_picoadk.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
datanoisetv_picoadk.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
datanoisetv_picoadk.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
datanoisetv_picoadk.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
datanoisetv_picoadk.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
datanoisetv_picoadk.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
datanoisetv_picoadk.menu.uploadmethod.default=Default (UF2)
datanoisetv_picoadk.menu.uploadmethod.default.build.ram_length=256k
datanoisetv_picoadk.menu.uploadmethod.default.build.debugscript=picoprobe.tcl
datanoisetv_picoadk.menu.uploadmethod.default.upload.maximum_data_size=262144
datanoisetv_picoadk.menu.uploadmethod.default.upload.tool=uf2conv
datanoisetv_picoadk.menu.uploadmethod.default.upload.tool.default=uf2conv
datanoisetv_picoadk.menu.uploadmethod.default.upload.tool.network=uf2conv-network
datanoisetv_picoadk.menu.uploadmethod.picotool=Picotool
datanoisetv_picoadk.menu.uploadmethod.picotool.build.ram_length=256k
datanoisetv_picoadk.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
datanoisetv_picoadk.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
datanoisetv_picoadk.menu.uploadmethod.picotool.upload.maximum_data_size=262144
datanoisetv_picoadk.menu.uploadmethod.picotool.upload.tool=picotool
datanoisetv_picoadk.menu.uploadmethod.picotool.upload.tool.default=picotool
datanoisetv_picoadk.menu.uploadmethod.picoprobe=Picoprobe
datanoisetv_picoadk.menu.uploadmethod.picoprobe.build.ram_length=256k
datanoisetv_picoadk.menu.uploadmethod.picoprobe.build.debugscript=picoprobe.tcl
datanoisetv_picoadk.menu.uploadmethod.picoprobe.upload.maximum_data_size=262144
datanoisetv_picoadk.menu.uploadmethod.picoprobe.upload.tool=picoprobe
datanoisetv_picoadk.menu.uploadmethod.picoprobe.upload.tool.default=picoprobe
datanoisetv_picoadk.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
datanoisetv_picoadk.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
datanoisetv_picoadk.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
datanoisetv_picoadk.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
datanoisetv_picoadk.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
datanoisetv_picoadk.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
datanoisetv_picoadk.menu.uploadmethod.picodebug=Pico-Debug
datanoisetv_picoadk.menu.uploadmethod.picodebug.build.ram_length=240k
datanoisetv_picoadk.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
datanoisetv_picoadk.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
datanoisetv_picoadk.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
datanoisetv_picoadk.menu.uploadmethod.picodebug.upload.tool=picodebug
datanoisetv_picoadk.menu.uploadmethod.picodebug.upload.tool.default=picodebug

