earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Solder Party RP2040 Stamp
# -----------------------------------
solderparty_rp2040_stamp.name=Solder Party RP2040 Stamp
solderparty_rp2040_stamp.vid.0=0x1209
solderparty_rp2040_stamp.pid.0=0xa182
solderparty_rp2040_stamp.vid.1=0x1209
solderparty_rp2040_stamp.pid.1=0xa182
solderparty_rp2040_stamp.vid.2=0x1209
solderparty_rp2040_stamp.pid.2=0xe182
solderparty_rp2040_stamp.vid.3=0x1209
solderparty_rp2040_stamp.pid.3=0xe182
solderparty_rp2040_stamp.vid.4=0x1209
solderparty_rp2040_stamp.pid.4=0xa182
solderparty_rp2040_stamp.vid.5=0x1209
solderparty_rp2040_stamp.pid.5=0xa182
solderparty_rp2040_stamp.vid.6=0x1209
solderparty_rp2040_stamp.pid.6=0xe182
solderparty_rp2040_stamp.vid.7=0x1209
solderparty_rp2040_stamp.pid.7=0xe182
solderparty_rp2040_stamp.build.usbvid=-DUSBD_VID=0x1209
solderparty_rp2040_stamp.build.usbpid=-DUSBD_PID=0xa182
solderparty_rp2040_stamp.build.usbpwr=-DUSBD_MAX_POWER_MA=500
solderparty_rp2040_stamp.build.board=SOLDERPARTY_RP2040_STAMP
solderparty_rp2040_stamp.build.mcu=cortex-m0plus
solderparty_rp2040_stamp.build.variant=solderparty_rp2040_stamp
solderparty_rp2040_stamp.upload.maximum_size=8388608
solderparty_rp2040_stamp.upload.wait_for_upload_port=true
solderparty_rp2040_stamp.upload.erase_cmd=
solderparty_rp2040_stamp.serial.disableDTR=false
solderparty_rp2040_stamp.serial.disableRTS=false
solderparty_rp2040_stamp.build.f_cpu=125000000
solderparty_rp2040_stamp.build.led=
solderparty_rp2040_stamp.build.core=rp2040
solderparty_rp2040_stamp.build.ldscript=memmap_default.ld
solderparty_rp2040_stamp.build.boot2=boot2_generic_03h_4_padded_checksum
solderparty_rp2040_stamp.build.usb_manufacturer="Solder Party"
solderparty_rp2040_stamp.build.usb_product="RP2040 Stamp"
solderparty_rp2040_stamp.menu.flash.8388608_0=8MB (no FS)
solderparty_rp2040_stamp.menu.flash.8388608_0.upload.maximum_size=8384512
solderparty_rp2040_stamp.menu.flash.8388608_0.build.flash_length=8384512
solderparty_rp2040_stamp.menu.flash.8388608_0.build.eeprom_start=276819968
solderparty_rp2040_stamp.menu.flash.8388608_0.build.fs_start=276819968
solderparty_rp2040_stamp.menu.flash.8388608_0.build.fs_end=276819968
solderparty_rp2040_stamp.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
solderparty_rp2040_stamp.menu.flash.8388608_65536.upload.maximum_size=8318976
solderparty_rp2040_stamp.menu.flash.8388608_65536.build.flash_length=8318976
solderparty_rp2040_stamp.menu.flash.8388608_65536.build.eeprom_start=276819968
solderparty_rp2040_stamp.menu.flash.8388608_65536.build.fs_start=276754432
solderparty_rp2040_stamp.menu.flash.8388608_65536.build.fs_end=276819968
solderparty_rp2040_stamp.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
solderparty_rp2040_stamp.menu.flash.8388608_131072.upload.maximum_size=8253440
solderparty_rp2040_stamp.menu.flash.8388608_131072.build.flash_length=8253440
solderparty_rp2040_stamp.menu.flash.8388608_131072.build.eeprom_start=276819968
solderparty_rp2040_stamp.menu.flash.8388608_131072.build.fs_start=276688896
solderparty_rp2040_stamp.menu.flash.8388608_131072.build.fs_end=276819968
solderparty_rp2040_stamp.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
solderparty_rp2040_stamp.menu.flash.8388608_262144.upload.maximum_size=8122368
solderparty_rp2040_stamp.menu.flash.8388608_262144.build.flash_length=8122368
solderparty_rp2040_stamp.menu.flash.8388608_262144.build.eeprom_start=276819968
solderparty_rp2040_stamp.menu.flash.8388608_262144.build.fs_start=276557824
solderparty_rp2040_stamp.menu.flash.8388608_262144.build.fs_end=276819968
solderparty_rp2040_stamp.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
solderparty_rp2040_stamp.menu.flash.8388608_524288.upload.maximum_size=7860224
solderparty_rp2040_stamp.menu.flash.8388608_524288.build.flash_length=7860224
solderparty_rp2040_stamp.menu.flash.8388608_524288.build.eeprom_start=276819968
solderparty_rp2040_stamp.menu.flash.8388608_524288.build.fs_start=276295680
solderparty_rp2040_stamp.menu.flash.8388608_524288.build.fs_end=276819968
solderparty_rp2040_stamp.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
solderparty_rp2040_stamp.menu.flash.8388608_1048576.upload.maximum_size=7335936
solderparty_rp2040_stamp.menu.flash.8388608_1048576.build.flash_length=7335936
solderparty_rp2040_stamp.menu.flash.8388608_1048576.build.eeprom_start=276819968
solderparty_rp2040_stamp.menu.flash.8388608_1048576.build.fs_start=275771392
solderparty_rp2040_stamp.menu.flash.8388608_1048576.build.fs_end=276819968
solderparty_rp2040_stamp.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
solderparty_rp2040_stamp.menu.flash.8388608_2097152.upload.maximum_size=6287360
solderparty_rp2040_stamp.menu.flash.8388608_2097152.build.flash_length=6287360
solderparty_rp2040_stamp.menu.flash.8388608_2097152.build.eeprom_start=276819968
solderparty_rp2040_stamp.menu.flash.8388608_2097152.build.fs_start=274722816
solderparty_rp2040_stamp.menu.flash.8388608_2097152.build.fs_end=276819968
solderparty_rp2040_stamp.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
solderparty_rp2040_stamp.menu.flash.8388608_3145728.upload.maximum_size=5238784
solderparty_rp2040_stamp.menu.flash.8388608_3145728.build.flash_length=5238784
solderparty_rp2040_stamp.menu.flash.8388608_3145728.build.eeprom_start=276819968
solderparty_rp2040_stamp.menu.flash.8388608_3145728.build.fs_start=273674240
solderparty_rp2040_stamp.menu.flash.8388608_3145728.build.fs_end=276819968
solderparty_rp2040_stamp.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
solderparty_rp2040_stamp.menu.flash.8388608_4194304.upload.maximum_size=4190208
solderparty_rp2040_stamp.menu.flash.8388608_4194304.build.flash_length=4190208
solderparty_rp2040_stamp.menu.flash.8388608_4194304.build.eeprom_start=276819968
solderparty_rp2040_stamp.menu.flash.8388608_4194304.build.fs_start=272625664
solderparty_rp2040_stamp.menu.flash.8388608_4194304.build.fs_end=276819968
solderparty_rp2040_stamp.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
solderparty_rp2040_stamp.menu.flash.8388608_5242880.upload.maximum_size=3141632
solderparty_rp2040_stamp.menu.flash.8388608_5242880.build.flash_length=3141632
solderparty_rp2040_stamp.menu.flash.8388608_5242880.build.eeprom_start=276819968
solderparty_rp2040_stamp.menu.flash.8388608_5242880.build.fs_start=271577088
solderparty_rp2040_stamp.menu.flash.8388608_5242880.build.fs_end=276819968
solderparty_rp2040_stamp.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
solderparty_rp2040_stamp.menu.flash.8388608_6291456.upload.maximum_size=2093056
solderparty_rp2040_stamp.menu.flash.8388608_6291456.build.flash_length=2093056
solderparty_rp2040_stamp.menu.flash.8388608_6291456.build.eeprom_start=276819968
solderparty_rp2040_stamp.menu.flash.8388608_6291456.build.fs_start=270528512
solderparty_rp2040_stamp.menu.flash.8388608_6291456.build.fs_end=276819968
solderparty_rp2040_stamp.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
solderparty_rp2040_stamp.menu.flash.8388608_7340032.upload.maximum_size=1044480
solderparty_rp2040_stamp.menu.flash.8388608_7340032.build.flash_length=1044480
solderparty_rp2040_stamp.menu.flash.8388608_7340032.build.eeprom_start=276819968
solderparty_rp2040_stamp.menu.flash.8388608_7340032.build.fs_start=269479936
solderparty_rp2040_stamp.menu.flash.8388608_7340032.build.fs_end=276819968
solderparty_rp2040_stamp.menu.freq.133=133 MHz
solderparty_rp2040_stamp.menu.freq.133.build.f_cpu=133000000L
solderparty_rp2040_stamp.menu.freq.50=50 MHz
solderparty_rp2040_stamp.menu.freq.50.build.f_cpu=50000000L
solderparty_rp2040_stamp.menu.freq.100=100 MHz
solderparty_rp2040_stamp.menu.freq.100.build.f_cpu=100000000L
solderparty_rp2040_stamp.menu.freq.120=120 MHz
solderparty_rp2040_stamp.menu.freq.120.build.f_cpu=120000000L
solderparty_rp2040_stamp.menu.freq.125=125 MHz
solderparty_rp2040_stamp.menu.freq.125.build.f_cpu=125000000L
solderparty_rp2040_stamp.menu.freq.150=150 MHz (Overclock)
solderparty_rp2040_stamp.menu.freq.150.build.f_cpu=150000000L
solderparty_rp2040_stamp.menu.freq.175=175 MHz (Overclock)
solderparty_rp2040_stamp.menu.freq.175.build.f_cpu=175000000L
solderparty_rp2040_stamp.menu.freq.200=200 MHz (Overclock)
solderparty_rp2040_stamp.menu.freq.200.build.f_cpu=200000000L
solderparty_rp2040_stamp.menu.freq.225=225 MHz (Overclock)
solderparty_rp2040_stamp.menu.freq.225.build.f_cpu=225000000L
solderparty_rp2040_stamp.menu.freq.240=240 MHz (Overclock)
solderparty_rp2040_stamp.menu.freq.240.build.f_cpu=240000000L
solderparty_rp2040_stamp.menu.freq.250=250 MHz (Overclock)
solderparty_rp2040_stamp.menu.freq.250.build.f_cpu=250000000L
solderparty_rp2040_stamp.menu.freq.275=275 MHz (Overclock)
solderparty_rp2040_stamp.menu.freq.275.build.f_cpu=275000000L
solderparty_rp2040_stamp.menu.freq.300=300 MHz (Overclock)
solderparty_rp2040_stamp.menu.freq.300.build.f_cpu=300000000L
solderparty_rp2040_stamp.menu.opt.Small=Small (-Os) (standard)
solderparty_rp2040_stamp.menu.opt.Small.build.flags.optimize=-Os
solderparty_rp2040_stamp.menu.opt.Optimize=Optimize (-O)
solderparty_rp2040_stamp.menu.opt.Optimize.build.flags.optimize=-O
solderparty_rp2040_stamp.menu.opt.Optimize2=Optimize More (-O2)
solderparty_rp2040_stamp.menu.opt.Optimize2.build.flags.optimize=-O2
solderparty_rp2040_stamp.menu.opt.Optimize3=Optimize Even More (-O3)
solderparty_rp2040_stamp.menu.opt.Optimize3.build.flags.optimize=-O3
solderparty_rp2040_stamp.menu.opt.Fast=Fast (-Ofast) (maybe slower)
solderparty_rp2040_stamp.menu.opt.Fast.build.flags.optimize=-Ofast
solderparty_rp2040_stamp.menu.opt.Debug=Debug (-Og)
solderparty_rp2040_stamp.menu.opt.Debug.build.flags.optimize=-Og
solderparty_rp2040_stamp.menu.rtti.Disabled=Disabled
solderparty_rp2040_stamp.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
solderparty_rp2040_stamp.menu.rtti.Enabled=Enabled
solderparty_rp2040_stamp.menu.rtti.Enabled.build.flags.rtti=
solderparty_rp2040_stamp.menu.stackprotect.Disabled=Disabled
solderparty_rp2040_stamp.menu.stackprotect.Disabled.build.flags.stackprotect=
solderparty_rp2040_stamp.menu.stackprotect.Enabled=Enabled
solderparty_rp2040_stamp.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
solderparty_rp2040_stamp.menu.exceptions.Disabled=Disabled
solderparty_rp2040_stamp.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
solderparty_rp2040_stamp.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
solderparty_rp2040_stamp.menu.exceptions.Enabled=Enabled
solderparty_rp2040_stamp.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
solderparty_rp2040_stamp.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
solderparty_rp2040_stamp.menu.dbgport.Disabled=Disabled
solderparty_rp2040_stamp.menu.dbgport.Disabled.build.debug_port=
solderparty_rp2040_stamp.menu.dbgport.Serial=Serial
solderparty_rp2040_stamp.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
solderparty_rp2040_stamp.menu.dbgport.Serial1=Serial1
solderparty_rp2040_stamp.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
solderparty_rp2040_stamp.menu.dbgport.Serial2=Serial2
solderparty_rp2040_stamp.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
solderparty_rp2040_stamp.menu.dbglvl.None=None
solderparty_rp2040_stamp.menu.dbglvl.None.build.debug_level=
solderparty_rp2040_stamp.menu.dbglvl.Core=Core
solderparty_rp2040_stamp.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
solderparty_rp2040_stamp.menu.dbglvl.SPI=SPI
solderparty_rp2040_stamp.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
solderparty_rp2040_stamp.menu.dbglvl.Wire=Wire
solderparty_rp2040_stamp.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
solderparty_rp2040_stamp.menu.dbglvl.All=All
solderparty_rp2040_stamp.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
solderparty_rp2040_stamp.menu.dbglvl.NDEBUG=NDEBUG
solderparty_rp2040_stamp.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
solderparty_rp2040_stamp.menu.usbstack.picosdk=Pico SDK
solderparty_rp2040_stamp.menu.usbstack.picosdk.build.usbstack_flags=
solderparty_rp2040_stamp.menu.usbstack.tinyusb=Adafruit TinyUSB
solderparty_rp2040_stamp.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
solderparty_rp2040_stamp.menu.usbstack.nousb=No USB
solderparty_rp2040_stamp.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
solderparty_rp2040_stamp.menu.ipbtstack.ipv4only=IPv4 Only
solderparty_rp2040_stamp.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
solderparty_rp2040_stamp.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
solderparty_rp2040_stamp.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
solderparty_rp2040_stamp.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
solderparty_rp2040_stamp.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
solderparty_rp2040_stamp.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
solderparty_rp2040_stamp.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
solderparty_rp2040_stamp.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
solderparty_rp2040_stamp.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
solderparty_rp2040_stamp.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
solderparty_rp2040_stamp.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
solderparty_rp2040_stamp.menu.uploadmethod.default=Default (UF2)
solderparty_rp2040_stamp.menu.uploadmethod.default.build.ram_length=256k
solderparty_rp2040_stamp.menu.uploadmethod.default.build.debugscript=picoprobe.tcl
solderparty_rp2040_stamp.menu.uploadmethod.default.upload.maximum_data_size=262144
solderparty_rp2040_stamp.menu.uploadmethod.default.upload.tool=uf2conv
solderparty_rp2040_stamp.menu.uploadmethod.default.upload.tool.default=uf2conv
solderparty_rp2040_stamp.menu.uploadmethod.default.upload.tool.network=uf2conv-network
solderparty_rp2040_stamp.menu.uploadmethod.picotool=Picotool
solderparty_rp2040_stamp.menu.uploadmethod.picotool.build.ram_length=256k
solderparty_rp2040_stamp.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
solderparty_rp2040_stamp.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
solderparty_rp2040_stamp.menu.uploadmethod.picotool.upload.maximum_data_size=262144
solderparty_rp2040_stamp.menu.uploadmethod.picotool.upload.tool=picotool
solderparty_rp2040_stamp.menu.uploadmethod.picotool.upload.tool.default=picotool
solderparty_rp2040_stamp.menu.uploadmethod.picoprobe=Picoprobe
solderparty_rp2040_stamp.menu.uploadmethod.picoprobe.build.ram_length=256k
solderparty_rp2040_stamp.menu.uploadmethod.picoprobe.build.debugscript=picoprobe.tcl
solderparty_rp2040_stamp.menu.uploadmethod.picoprobe.upload.maximum_data_size=262144
solderparty_rp2040_stamp.menu.uploadmethod.picoprobe.upload.tool=picoprobe
solderparty_rp2040_stamp.menu.uploadmethod.picoprobe.upload.tool.default=picoprobe
solderparty_rp2040_stamp.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
solderparty_rp2040_stamp.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
solderparty_rp2040_stamp.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
solderparty_rp2040_stamp.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
solderparty_rp2040_stamp.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
solderparty_rp2040_stamp.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
solderparty_rp2040_stamp.menu.uploadmethod.picodebug=Pico-Debug
solderparty_rp2040_stamp.menu.uploadmethod.picodebug.build.ram_length=240k
solderparty_rp2040_stamp.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
solderparty_rp2040_stamp.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
solderparty_rp2040_stamp.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
solderparty_rp2040_stamp.menu.uploadmethod.picodebug.upload.tool=picodebug
solderparty_rp2040_stamp.menu.uploadmethod.picodebug.upload.tool.default=picodebug

